RT-Thread/rt-thread/bsp/apm32/libraries/APM32S10x_Library/APM32S10x_StdPeriphDriver/src/apm32s10x_rcm.c
/*!
 * @file        apm32s10x_rcm.c
 *
 * @brief       This file provides all the RCM firmware functions
 *
 * @version     V1.0.1
 *
 * @date        2022-12-31
 *
 * @attention
 *
 *  Copyright (C) 2022-2023 Geehy Semiconductor
 *
 *  You may not use this file except in compliance with the
 *  GEEHY COPYRIGHT NOTICE (GEEHY SOFTWARE PACKAGE LICENSE).
 *
 *  The program is only for reference, which is distributed in the hope
 *  that it will be usefull and instructional for customers to develop
 *  their software. Unless required by applicable law or agreed to in
 *  writing, the program is distributed on an "AS IS" BASIS, WITHOUT
 *  ANY WARRANTY OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the GEEHY SOFTWARE PACKAGE LICENSE for the governing permissions
 *  and limitations under the License.
 */

/* Includes */
#include "apm32s10x_rcm.h"

/** @addtogroup APM32S10x_StdPeriphDriver
  @{
*/

/** @addtogroup RCM_Driver RCM Driver
  @{
*/

/** @defgroup RCM_Functions Functions
  @{
*/

/*!
 * @brief     Reset the clock configuration to the default state
 *
 * @param     None
 *
 * @retval    None
 */
void RCM_Reset(void)
{
    /* Open HSI clock */
    RCM->CTRL_B.HSIEN = BIT_SET;
    /* Config HSI to system clock and Reset AHBPSC, APB1PSC, APB2PSC, ADCPSC and MCOSEL bits */
    RCM->CFG &= (uint32_t)0xF8FF0000;
    /* Reset HSEEN, CSSEN and PLLEN bits */
    RCM->CTRL &= (uint32_t)0xFEF6FFFF;
    /* Reset HSEBCFG bit */
    RCM->CTRL_B.HSEBCFG = BIT_RESET;
    /* Reset PLLSRCSEL, PLLHSEPSC, PLLMULCFG and USBDIV bits */
    RCM->CFG &= (uint32_t)0xFF00FFFF;
    /* Disable all interrupts and clear pending bits */
    RCM->INT = 0x009F0000;
}

/*!
 * @brief     Configure the HSE oscillator
 *
 * @param     state: state of the HSE
 *              This parameter can be one of the following values:
 *              @arg RCM_HSE_CLOSE:  Turn off the HSE oscillator
 *              @arg RCM_HSE_OPEN:   Turn on the HSE oscillator
 *              @arg RCM_HSE_BYPASS: HSE oscillator bypassed with external clock
 *
 * @retval    None
 *
 * @note      When HSE is not used directly or through the PLL as system clock, it can be stopped.
 */
void RCM_ConfigHSE(RCM_HSE_T state)
{
    /* Reset HSEEN bit */
    RCM->CTRL_B.HSEEN = BIT_RESET;

    /* Reset HSEBCFG bit */
    RCM->CTRL_B.HSEBCFG = BIT_RESET;

    if (state == RCM_HSE_OPEN)
    {
        RCM->CTRL_B.HSEEN = BIT_SET;
    }
    else if (state == RCM_HSE_BYPASS)
    {
        RCM->CTRL_B.HSEBCFG = BIT_SET;
        RCM->CTRL_B.HSEEN = BIT_SET;
    }
}

/*!
 * @brief     Wait for HSE to be ready
 *
 * @param     None
 *
 * @retval    SUCCESS: HSE oscillator is ready
 *            ERROR  : HSE oscillator is not ready
 */
uint8_t RCM_WaitHSEReady(void)
{
    __IO uint32_t cnt;

    for (cnt = 0; cnt < HSE_STARTUP_TIMEOUT; cnt++)
    {
        if (RCM->CTRL_B.HSERDYFLG == BIT_SET)
        {
            return SUCCESS;
        }
    }

    return ERROR;
}

/*!
 * @brief     Configure HSI trimming value
 *
 * @param     HSITrim: HSI trimming value
 *              This parameter must be a number between 0 and 0x1F.
 *
 * @retval    None
 */
void RCM_ConfigHSITrim(uint8_t HSITrim)
{
    RCM->CTRL_B.HSITRIM = HSITrim;
}

/*!
 * @brief     Enable the HSI
 *
 * @param     None
 *
 * @retval    None
 */
void RCM_EnableHSI(void)
{
    RCM->CTRL_B.HSIEN = BIT_SET;
}

/*!
 * @brief     Disable the HSI
 *
 * @param     None
 *
 * @retval    None
 *
 * @note      When HSI is not used directly or through the PLL as system clock, it can be stopped.
 */

void RCM_DisableHSI(void)
{
    RCM->CTRL_B.HSIEN = BIT_RESET;
}

/*!
 * @brief     Configure the External Low Speed oscillator (LSE)
 *
 * @param     state : Specify the new state of the LSE
 *              This parameter can be one of the following values:
 *              @arg RCM_LSE_CLOSE  : Close the LSE
 *              @arg RCM_LSE_OPEN   : Open the LSE
 *              @arg RCM_LSE_BYPASS : LSE bypass
 *
 * @retval    None
 */
void RCM_ConfigLSE(RCM_LSE_T state)
{
    RCM->BDCTRL_B.LSEEN = BIT_RESET;
    RCM->BDCTRL_B.LSEBCFG = BIT_RESET;

    if (state == RCM_LSE_OPEN)
    {
        RCM->BDCTRL_B.LSEEN = BIT_SET;
    }
    else if (state == RCM_LSE_BYPASS)
    {
        RCM->BDCTRL_B.LSEBCFG = BIT_SET;
        RCM->BDCTRL_B.LSEEN = BIT_SET;
    }
}

/*!
 * @brief     Enable the Internal Low Speed oscillator (LSI)
 *
 * @param     None
 *
 * @retval    None
 */
void RCM_EnableLSI(void)
{
    RCM->CSTS_B.LSIEN = BIT_SET;
}

/*!
 * @brief     Disable the Internal Low Speed oscillator (LSI)
 *
 * @param     None
 *
 * @retval    None
 */
void RCM_DisableLSI(void)
{
    RCM->CSTS_B.LSIEN = BIT_RESET;
}

/*!
 * @brief     Configure the PLL clock source and multiplication factor
 *
 * @param     pllSelect : PLL entry clock source select
 *              This parameter can be one of the following values:
 *              @arg RCM_PLLSEL_HSI_DIV_2: HSI clock divided by 2 selected as PLL clock source
 *              @arg RCM_PLLSEL_HSE:       HSE clock selected as PLL clock source
 *              @arg RCM_PLLSEL_HSE_DIV2:  HSE clock divided by 2 selected as PLL clock source
 *
 * @param     pllMf : PLL multiplication factor
 *              This parameter can be RCM_PLLMF_x where x can be a value from 2 to 16.
 *
 * @retval    None
 *
 * @note      PLL should be disabled while use this function.
 */
void RCM_ConfigPLL(RCM_PLLSEL_T pllSelect, RCM_PLLMF_T pllMf)
{
    RCM->CFG_B.PLLMULCFG = pllMf;
    RCM->CFG_B.PLLSRCSEL = pllSelect & 0x01;
    RCM->CFG_B.PLLHSEPSC = (pllSelect >> 1) & 0x01;
}

/*!
 * @brief      Enable the PLL
 *
 * @param      None
 *
 * @retval     None
 */
void RCM_EnablePLL(void)
{
    RCM->CTRL_B.PLLEN = BIT_SET;
}

/*!
* @brief      Disable the PLL
*
* @param      None
*
* @retval     None
*
* @note       When PLL is not used as system clock, it can be stopped.
*/
void RCM_DisablePLL(void)
{
    RCM->CTRL_B.PLLEN = BIT_RESET;
}

/*!
 * @brief     Enable the Clock Security System
 *
 * @param     None
 *
 * @retval    None
 */
void RCM_EnableCSS(void)
{
    RCM->CTRL_B.CSSEN = BIT_SET;
}

/*!
 * @brief     Disable the Clock Security System
 *
 * @param     None
 *
 * @retval    None
 */
void RCM_DisableCSS(void)
{
    RCM->CTRL_B.CSSEN = BIT_RESET;
}

/*!
 * @brief     Select the MCO pin clock ouput source
 *
 * @param     mcoClock: specify the clock source to output
 *              This parameter can be one of the following values:
 *              @arg RCM_MCOCLK_NO_CLOCK     : No clock selected.
 *              @arg RCM_MCOCLK_SYSCLK       : System clock selected.
 *              @arg RCM_MCOCLK_HSI          : HSI oscillator clock selected.
 *              @arg RCM_MCOCLK_HSE          : HSE oscillator clock selected.
 *              @arg RCM_MCOCLK_PLLCLK_DIV_2 : PLL clock divided by 2 selected.
 *
 * @retval    None
 */
void RCM_ConfigMCO(RCM_MCOCLK_T mcoClock)
{
    RCM->CFG_B.MCOSEL = mcoClock;
}

/*!
 * @brief    Configure the system clock source
 *
 * @param    sysClkSelect: specify the clock source used as system clock
 *             This parameter can be one of the following values:
 *             @arg RCM_SYSCLK_SEL_HSI: HSI is selected as system clock source
 *             @arg RCM_SYSCLK_SEL_HSE: HSE is selected as system clock source
 *             @arg RCM_SYSCLK_SEL_PLL: PLL is selected as system clock source
 *
 * @retva    None
 */
void RCM_ConfigSYSCLK(RCM_SYSCLK_SEL_T sysClkSelect)
{
    RCM->CFG_B.SCLKSEL = sysClkSelect;
}

/*!
 * @brief     Return the clock source which is used as system clock
 *
 * @param     None
 *
 * @retval    The clock source used as system clock
 */
RCM_SYSCLK_SEL_T RCM_ReadSYSCLKSource(void)
{
    return (RCM_SYSCLK_SEL_T)RCM->CFG_B.SCLKSELSTS;
}

/*!
 * @brief     Configure the AHB clock prescaler.
 *
 * @param     AHBDiv : Specify the AHB clock prescaler from the system clock.
 *              This parameter can be one of the following values:
 *              @arg RCM_AHB_DIV_1   : HCLK = SYSCLK
 *              @arg RCM_AHB_DIV_2   : HCLK = SYSCLK / 2
 *              @arg RCM_AHB_DIV_4   : HCLK = SYSCLK / 4
 *              @arg RCM_AHB_DIV_8   : HCLK = SYSCLK / 8
 *              @arg RCM_AHB_DIV_16  : HCLK = SYSCLK / 16
 *              @arg RCM_AHB_DIV_64  : HCLK = SYSCLK / 64
 *              @arg RCM_AHB_DIV_128 : HCLK = SYSCLK / 128
 *              @arg RCM_AHB_DIV_256 : HCLK = SYSCLK / 256
 *              @arg RCM_AHB_DIV_512 : HCLK = SYSCLK / 512
 *
 * @retval    None
 */
void RCM_ConfigAHB(RCM_AHB_DIV_T AHBDiv)
{
    RCM->CFG_B.AHBPSC = AHBDiv;
}

/*!
 * @brief     Configure the APB1 clock prescaler.
 *
 * @param     APB1Div: Specify the APB1 clock prescaler from the AHB clock.
 *              This parameter can be one of the following values:
 *              @arg RCM_APB_DIV_1  : PCLK1 = HCLK
 *              @arg RCM_APB_DIV_2  : PCLK1 = HCLK / 2
 *              @arg RCM_APB_DIV_4  : PCLK1 = HCLK / 4
 *              @arg RCM_APB_DIV_8  : PCLK1 = HCLK / 8
 *              @arg RCM_APB_DIV_16 : PCLK1 = HCLK / 16
 *
 * @retval    None
 */
void RCM_ConfigAPB1(RCM_APB_DIV_T APB1Div)
{
    RCM->CFG_B.APB1PSC = APB1Div;
}

/*!
 * @brief     Configure the APB2 clock prescaler
 *
 * @param     APB2Div: Specify the APB2 clock prescaler from the AHB clock.
 *              This parameter can be one of the following values:
 *              @arg RCM_APB_DIV_1  : PCLK2 = HCLK
 *              @arg RCM_APB_DIV_2  : PCLK2 = HCLK / 2
 *              @arg RCM_APB_DIV_4  : PCLK2 = HCLK / 4
 *              @arg RCM_APB_DIV_8  : PCLK2 = HCLK / 8
 *              @arg RCM_APB_DIV_16 : PCLK2 = HCLK / 16
 *
 * @retval    None
 */
void RCM_ConfigAPB2(RCM_APB_DIV_T APB2Div)
{
    RCM->CFG_B.APB2PSC = APB2Div;
}

/*!
 * @brief     Configure the USB clock prescaler
 *
 * @param     USBDiv: Specify the USB clock prescaler from the PLL clock.
 *              This parameter can be one of the following values:
 *              @arg RCM_USB_DIV_1_5 : USBCLK = PLL clock /1.5
 *              @arg RCM_USB_DIV_1   : USBCLK = PLL clock
 *              @arg RCM_USB_DIV_2   : USBCLK = PLL clock / 2
 *
 * @retval    None
 */
void RCM_ConfigUSBCLK(RCM_USB_DIV_T USBDiv)
{
    RCM->CFG_B.USBDPSC = USBDiv;
}

/*!
 * @brief     Configure the FPU clock prescaler
 *
 * @param     FPUDiv: Specify the FPU clock prescaler from the AHB clock.
 *              This parameter can be one of the following values:
 *              @arg RCM_FPU_DIV_1 : FPUCLK = HCLK
 *              @arg RCM_FPU_DIV_2 : FPUCLK = HCLK /2
 *
 * @retval    None
 */
void RCM_ConfigFPUCLK(RCM_FPU_DIV_T FPUDiv)
{
    RCM->CFG_B.FPUPSC = FPUDiv;
}

/*!
 * @brief     Configure the ADC clock prescaler
 *
 * @param     ADCDiv : Specify the ADC clock prescaler from the APB2 clock.
 *              This parameter can be one of the following values:
 *              @arg RCM_PCLK2_DIV_2: ADCCLK = PCLK2 / 2
 *              @arg RCM_PCLK2_DIV_4: ADCCLK = PCLK2 / 4
 *              @arg RCM_PCLK2_DIV_6: ADCCLK = PCLK2 / 6
 *              @arg RCM_PCLK2_DIV_8: ADCCLK = PCLK2 / 8
 *
 * @retval    None
 */
void RCM_ConfigADCCLK(RCM_PCLK2_DIV_T ADCDiv)
{
    RCM->CFG_B.ADCPSC = ADCDiv;
}

/*!
 * @brief     Configure the RTC clock source
 *
 * @param     rtcClkSelect : specify the RTC clock source.
 *              This parameter can be one of the following values:
 *              @arg RCM_RTCCLK_LSE        : RTCCLK = LSE clock
 *              @arg RCM_RTCCLK_LSI        : RTCCLK = LSI clock
 *              @arg RCM_RTCCLK_HSE_DIV_128: RTCCLK = HSE clock / 128
 *
 * @retval    None
 *
 * @note      Once the RTC clock is configed it can't be changed unless reset the Backup domain.
 */
void RCM_ConfigRTCCLK(RCM_RTCCLK_T rtcClkSelect)
{
    RCM->BDCTRL_B.RTCSRCSEL = rtcClkSelect;
}

/*!
 * @brief     Enable the RTC clock
 *
 * @param     None
 *
 * @retval    None
 */
void RCM_EnableRTCCLK(void)
{
    RCM->BDCTRL_B.RTCCLKEN = BIT_SET;
}

/*!
 * @brief     Disable the RTC clock
 *
 * @param     None
 *
 * @retval    None
 */
void RCM_DisableRTCCLK(void)
{
    RCM->BDCTRL_B.RTCCLKEN = BIT_RESET;
}

/*!
 * @brief     Reads the frequency of SYSCLK
 *
 * @param     None
 *
 * @retval    Return the frequency of SYSCLK
 */
uint32_t RCM_ReadSYSCLKFreq(void)
{
    uint32_t sysClock, pllMull, pllSource;

    /* get sys clock */
    sysClock = RCM->CFG_B.SCLKSEL;

    switch (sysClock)
    {
        /* sys clock is HSI */
        case RCM_SYSCLK_SEL_HSI:
            sysClock = HSI_VALUE;
            break;

        /* sys clock is HSE */
        case RCM_SYSCLK_SEL_HSE:
            sysClock = HSE_VALUE;
            break;

        /* sys clock is PLL */
        case RCM_SYSCLK_SEL_PLL:
            pllMull = RCM->CFG_B.PLLMULCFG + 2;
            pllSource = RCM->CFG_B.PLLSRCSEL;

            /* PLL entry clock source is HSE */
            if (pllSource == BIT_SET)
            {
                sysClock = HSE_VALUE * pllMull;

                /* HSE clock divided by 2 */
                if (pllSource == RCM->CFG_B.PLLHSEPSC)
                {
                    sysClock >>= 1;
                }
            }
            /* PLL entry clock source is HSI/2 */
            else
            {
                sysClock = (HSI_VALUE >> 1) * pllMull;
            }

            break;

        default:
            sysClock  = HSI_VALUE;
            break;
    }

