RT-Thread/rt-thread/bsp/apm32/libraries/APM32S10x_Library/APM32S10x_StdPeriphDriver/src/apm32s10x_rcm.c
    return sysClock;
}

/*!
 * @brief     Read the frequency of HCLK(AHB)
 *
 * @param     None
 *
 * @retval    Return the frequency of HCLK
 */
uint32_t RCM_ReadHCLKFreq(void)
{
    uint32_t divider;
    uint32_t sysClk, hclk;
    uint8_t AHBPrescTable[16] = {0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9};

    sysClk = RCM_ReadSYSCLKFreq();
    divider = AHBPrescTable[RCM->CFG_B.AHBPSC];
    hclk = sysClk >> divider;

    return hclk;
}

/*!
 * @brief     Read the frequency of PCLK1 And PCLK2
 *
 * @param     PCLK1 : Return the frequency of PCLK1
 *
 * @param     PCLK1 : Return the frequency of PCLK2
 *
 * @retval    None
 */
void RCM_ReadPCLKFreq(uint32_t* PCLK1, uint32_t* PCLK2)
{
    uint32_t hclk, divider;
    uint8_t APBPrescTable[8] = {0, 0, 0, 0, 1, 2, 3, 4};

    hclk = RCM_ReadHCLKFreq();

    if (PCLK1)
    {
        divider = APBPrescTable[RCM->CFG_B.APB1PSC];
        *PCLK1 = hclk >> divider;
    }

    if (PCLK2)
    {
        divider = APBPrescTable[RCM->CFG_B.APB2PSC];
        *PCLK2 = hclk >> divider;
    }
}

/*!
 * @brief     Read the frequency of ADCCLK
 *
 * @param     None
 *
 * @retval    Return the frequency of ADCCLK
 */
uint32_t RCM_ReadADCCLKFreq(void)
{
    uint32_t adcClk, pclk2, divider;
    uint8_t ADCPrescTable[4] = {2, 4, 6, 8};

    RCM_ReadPCLKFreq(NULL, &pclk2);

    /** Get ADC CLK */
    divider = ADCPrescTable[RCM->CFG_B.ADCPSC];
    adcClk = pclk2 / divider;

    return adcClk;
}

/*!
 * @brief    Enables AHB peripheral clock.
 *
 * @param    AHBPeriph : Enable the specified clock of AHB peripheral.
 *             This parameter can be any combination of the following values:
 *             @arg RCM_AHB_PERIPH_DMA1 : Enable DMA1 clock
 *             @arg RCM_AHB_PERIPH_SRAM : Enable SRAM clock
 *             @arg RCM_AHB_PERIPH_FPU  : Enable FPU clock
 *             @arg RCM_AHB_PERIPH_FMC  : Enable FMC clock
 *             @arg RCM_AHB_PERIPH_QSPI : Enable QSPI clock
 *             @arg RCM_AHB_PERIPH_CRC  : Enable CRC clock
 *
 * @retval   None
 */
void RCM_EnableAHBPeriphClock(uint32_t AHBPeriph)
{
    RCM->AHBCLKEN |= AHBPeriph;
}

/*!
 * @brief    Disable AHB peripheral clock.
 *
 * @param    AHBPeriph : Disable the specified clock of AHB peripheral.
 *             This parameter can be any combination of the following values:
 *             @arg RCM_AHB_PERIPH_DMA1 : Disable DMA1 clock
 *             @arg RCM_AHB_PERIPH_SRAM : Disable SRAM clock
 *             @arg RCM_AHB_PERIPH_FPU  : Disable FPU clock
 *             @arg RCM_AHB_PERIPH_FMC  : Disable FMC clock
 *             @arg RCM_AHB_PERIPH_QSPI : Disable QSPI clock
 *             @arg RCM_AHB_PERIPH_CRC  : Disable CRC clock
 *
 * @retval   None
 */
void RCM_DisableAHBPeriphClock(uint32_t AHBPeriph)
{
    RCM->AHBCLKEN &= (uint32_t)~AHBPeriph;
}

/*!
 * @brief    Enable the High Speed APB (APB2) peripheral clock
 *
 * @param    APB2Periph : Enable the specified clock of the APB2 peripheral.
 *             This parameter can be any combination of the following values:
 *             @arg RCM_APB2_PERIPH_AFIO   : Enable AFIO clock
 *             @arg RCM_APB2_PERIPH_GPIOA  : Enable GPIOA clock
 *             @arg RCM_APB2_PERIPH_GPIOB  : Enable GPIOB clock
 *             @arg RCM_APB2_PERIPH_GPIOC  : Enable GPIOC clock
 *             @arg RCM_APB2_PERIPH_GPIOD  : Enable GPIOD clock
 *             @arg RCM_APB2_PERIPH_GPIOE  : Enable GPIOE clock
 *             @arg RCM_APB2_PERIPH_ADC1   : Enable ADC1 clock
 *             @arg RCM_APB2_PERIPH_ADC2   : Enable ADC2 clock
 *             @arg RCM_APB2_PERIPH_TMR1   : Enable TMR1 clock
 *             @arg RCM_APB2_PERIPH_SPI1   : Enable SPI1 clock
 *             @arg RCM_APB2_PERIPH_USART1 : Enable USART1 clock
 *
 * @retval   None
 */
void RCM_EnableAPB2PeriphClock(uint32_t APB2Periph)
{
    RCM->APB2CLKEN |= APB2Periph;
}

/*!
 * @brief    Disable the High Speed APB (APB2) peripheral clock
 *
 * @param    APB2Periph : Disable the specified clock of the APB2 peripheral.
 *             This parameter can be any combination of the following values:
 *             @arg RCM_APB2_PERIPH_AFIO   : Disable AFIO clock
 *             @arg RCM_APB2_PERIPH_GPIOA  : Disable GPIOA clock
 *             @arg RCM_APB2_PERIPH_GPIOB  : Disable GPIOB clock
 *             @arg RCM_APB2_PERIPH_GPIOC  : Disable GPIOC clock
 *             @arg RCM_APB2_PERIPH_GPIOD  : Disable GPIOD clock
 *             @arg RCM_APB2_PERIPH_GPIOE  : Disable GPIOE clock
 *             @arg RCM_APB2_PERIPH_ADC1   : Disable ADC1 clock
 *             @arg RCM_APB2_PERIPH_ADC2   : Disable ADC2 clock
 *             @arg RCM_APB2_PERIPH_TMR1   : Disable TMR1 clock
 *             @arg RCM_APB2_PERIPH_SPI1   : Disable SPI1 clock
 *             @arg RCM_APB2_PERIPH_USART1 : Disable USART1 clock
 *
 * @retval   None
 */
void RCM_DisableAPB2PeriphClock(uint32_t APB2Periph)
{
    RCM->APB2CLKEN &= (uint32_t)~APB2Periph;
}

/*!
 * @brief    Enable the Low Speed APB (APB1) peripheral clock
 *
 * @param    APB1Periph : Enable the specified clock of the APB1 peripheral.
 *             This parameter can be any combination of the following values:
 *             @arg RCM_APB1_PERIPH_TMR2   : Enable TMR2 clock
 *             @arg RCM_APB1_PERIPH_TMR3   : Enable TMR3 clock
 *             @arg RCM_APB1_PERIPH_TMR4   : Enable TMR4 clock
 *             @arg RCM_APB1_PERIPH_WWDT   : Enable WWDT clock
 *             @arg RCM_APB1_PERIPH_SPI2   : Enable SPI2 clock
 *             @arg RCM_APB1_PERIPH_USART2 : Enable USART2 clock
 *             @arg RCM_APB1_PERIPH_USART3 : Enable USART3 clock
 *             @arg RCM_APB1_PERIPH_I2C1   : Enable I2C1 clock
 *             @arg RCM_APB1_PERIPH_I2C2   : Enable I2C2 clock
 *             @arg RCM_APB1_PERIPH_USB    : Enable USB clock
 *             @arg RCM_APB1_PERIPH_CAN1   : Enable CAN1 clock
 *             @arg RCM_APB1_PERIPH_CAN2   : Enable CAN2 clock
 *             @arg RCM_APB1_PERIPH_BAKR   : Enable BAKR clock
 *             @arg RCM_APB1_PERIPH_PMU    : Enable PMU clock
 *
 * @retval   None
 */
void RCM_EnableAPB1PeriphClock(uint32_t APB1Periph)
{
    RCM->APB1CLKEN |= APB1Periph;
}

/*!
 * @brief    Disable the Low Speed APB (APB1) peripheral clock
 *
 * @param    APB1Periph : Disable the specified clock of the APB1 peripheral.
 *             This parameter can be any combination of the following values:
 *             @arg RCM_APB1_PERIPH_TMR2   : Disable TMR2 clock
 *             @arg RCM_APB1_PERIPH_TMR3   : Disable TMR3 clock
 *             @arg RCM_APB1_PERIPH_TMR4   : Disable TMR4 clock
 *             @arg RCM_APB1_PERIPH_WWDT   : Disable WWDT clock
 *             @arg RCM_APB1_PERIPH_SPI2   : Disable SPI2 clock
 *             @arg RCM_APB1_PERIPH_USART2 : Disable USART2 clock
 *             @arg RCM_APB1_PERIPH_USART3 : Disable USART3 clock
 *             @arg RCM_APB1_PERIPH_I2C1   : Disable I2C1 clock
 *             @arg RCM_APB1_PERIPH_I2C2   : Disable I2C2 clock
 *             @arg RCM_APB1_PERIPH_USB    : Disable USB clock
 *             @arg RCM_APB1_PERIPH_CAN1   : Disable CAN1 clock
 *             @arg RCM_APB1_PERIPH_CAN2   : Disable CAN2 clock
 *             @arg RCM_APB1_PERIPH_BAKR   : Disable BAKR clock
 *             @arg RCM_APB1_PERIPH_PMU    : Disable PMU clock
 *
 * @retval   None
 */
void RCM_DisableAPB1PeriphClock(uint32_t APB1Periph)
{
    RCM->APB1CLKEN &= (uint32_t)~APB1Periph;
}

/*!
 * @brief    Enable High Speed APB (APB2) peripheral reset
 *
 * @param    APB2Periph : Enable the specified APB2 peripheral reset.
 *             This parameter can be any combination of the following values:
 *             @arg RCM_APB2_PERIPH_AFIO   : Enable AFIO reset
 *             @arg RCM_APB2_PERIPH_GPIOA  : Enable GPIOA reset
 *             @arg RCM_APB2_PERIPH_GPIOB  : Enable GPIOB reset
 *             @arg RCM_APB2_PERIPH_GPIOC  : Enable GPIOC reset
 *             @arg RCM_APB2_PERIPH_GPIOD  : Enable GPIOD reset
 *             @arg RCM_APB2_PERIPH_GPIOE  : Enable GPIOE reset
 *             @arg RCM_APB2_PERIPH_ADC1   : Enable ADC1 reset
 *             @arg RCM_APB2_PERIPH_ADC2   : Enable ADC2 reset
 *             @arg RCM_APB2_PERIPH_TMR1   : Enable TMR1 reset
 *             @arg RCM_APB2_PERIPH_SPI1   : Enable SPI1 reset
 *             @arg RCM_APB2_PERIPH_USART1 : Enable USART1 reset
 *
 * @retval   None
 */
void RCM_EnableAPB2PeriphReset(uint32_t APB2Periph)
{
    RCM->APB2RST |= APB2Periph;
}

/*!
 * @brief    Disable High Speed APB (APB2) peripheral reset
 *
 * @param    APB2Periph : Disable the specified APB2 peripheral reset.
 *             This parameter can be any combination of the following values:
 *             @arg RCM_APB2_PERIPH_AFIO   : Disable AFIO reset
 *             @arg RCM_APB2_PERIPH_GPIOA  : Disable GPIOA reset
 *             @arg RCM_APB2_PERIPH_GPIOB  : Disable GPIOB reset
 *             @arg RCM_APB2_PERIPH_GPIOC  : Disable GPIOC reset
 *             @arg RCM_APB2_PERIPH_GPIOD  : Disable GPIOD reset
 *             @arg RCM_APB2_PERIPH_GPIOE  : Disable GPIOE reset
 *             @arg RCM_APB2_PERIPH_ADC1   : Disable ADC1 reset
 *             @arg RCM_APB2_PERIPH_ADC2   : Disable ADC2 reset
 *             @arg RCM_APB2_PERIPH_TMR1   : Disable TMR1 reset
 *             @arg RCM_APB2_PERIPH_SPI1   : Disable SPI1 reset
 *             @arg RCM_APB2_PERIPH_USART1 : Disable USART1 reset
 *
 * @retval   None
 */
void RCM_DisableAPB2PeriphReset(uint32_t APB2Periph)
{
    RCM->APB2RST &= (uint32_t)~APB2Periph;
}

/*!
 * @brief    Enable Low Speed APB (APB1) peripheral reset
 *
 * @param    APB1Periph : Enable the specified APB1 peripheral reset.
 *             This parameter can be any combination of the following values:
 *             @arg RCM_APB1_PERIPH_TMR2   : Enable TMR2 reset
 *             @arg RCM_APB1_PERIPH_TMR3   : Enable TMR3 reset
 *             @arg RCM_APB1_PERIPH_TMR4   : Enable TMR4 reset
 *             @arg RCM_APB1_PERIPH_WWDT   : Enable WWDT reset
 *             @arg RCM_APB1_PERIPH_SPI2   : Enable SPI2 reset
 *             @arg RCM_APB1_PERIPH_USART2 : Enable USART2 reset
 *             @arg RCM_APB1_PERIPH_USART3 : Enable USART3 reset
 *             @arg RCM_APB1_PERIPH_I2C1   : Enable I2C1 reset
 *             @arg RCM_APB1_PERIPH_I2C2   : Enable I2C2 reset
 *             @arg RCM_APB1_PERIPH_USB    : Enable USB reset
 *             @arg RCM_APB1_PERIPH_CAN1   : Enable CAN1 reset
 *             @arg RCM_APB1_PERIPH_CAN2   : Enable CAN2 reset
 *             @arg RCM_APB1_PERIPH_BAKR   : Enable BAKR reset
 *             @arg RCM_APB1_PERIPH_PMU    : Enable PMU reset
 *
 * @retval   None
 */
void RCM_EnableAPB1PeriphReset(uint32_t APB1Periph)
{
    RCM->APB1RST |= APB1Periph;
}

/*!
 * @brief    Disable Low Speed APB (APB1) peripheral reset
 *
 * @param    APB1Periph : Disable the specified APB1 peripheral reset.
 *             This parameter can be any combination of the following values:
 *             @arg RCM_APB1_PERIPH_TMR2   : Disable TMR2 reset
 *             @arg RCM_APB1_PERIPH_TMR3   : Disable TMR3 reset
 *             @arg RCM_APB1_PERIPH_TMR4   : Disable TMR4 reset
 *             @arg RCM_APB1_PERIPH_WWDT   : Disable WWDT reset
 *             @arg RCM_APB1_PERIPH_SPI2   : Disable SPI2 reset
 *             @arg RCM_APB1_PERIPH_USART2 : Disable USART2 reset
 *             @arg RCM_APB1_PERIPH_USART3 : Disable USART3 reset
 *             @arg RCM_APB1_PERIPH_I2C1   : Disable I2C1 reset
 *             @arg RCM_APB1_PERIPH_I2C2   : Disable I2C2 reset
 *             @arg RCM_APB1_PERIPH_USB    : Disable USB reset
 *             @arg RCM_APB1_PERIPH_CAN1   : Disable CAN1 reset
 *             @arg RCM_APB1_PERIPH_CAN2   : Disable CAN2 reset
 *             @arg RCM_APB1_PERIPH_BAKR   : Disable BAKR reset
 *             @arg RCM_APB1_PERIPH_PMU    : Disable PMU reset
 *
 * @retval   None
 */
void RCM_DisableAPB1PeriphReset(uint32_t APB1Periph)
{
    RCM->APB1RST &= (uint32_t)~APB1Periph;
}

/*!
 * @brief     Enable the Backup domain reset
 *
 * @param     None
 *
 * @retval    None
 *
 */
void RCM_EnableBackupReset(void)
{
    RCM->BDCTRL_B.BDRST = BIT_SET;
}

/*!
 * @brief     Disable the Backup domain reset
 *
 * @param     None
 *
 * @retval    None
 */
void RCM_DisableBackupReset(void)
{
    RCM->BDCTRL_B.BDRST = BIT_RESET;
}

/*!
 * @brief     Enable RCM interrupts
 *
 * @param     interrupt : Enable the specified RCM interrupt sources.
 *              This parameter can be any combination of the following values:
 *              @arg RCM_INT_LSIRDY : LSI ready interrupt
 *              @arg RCM_INT_LSERDY : LSE ready interrupt
 *              @arg RCM_INT_HSIRDY : HSI ready interrupt
 *              @arg RCM_INT_HSERDY : HSE ready interrupt
 *              @arg RCM_INT_PLLRDY : PLL ready interrupt
 *
 * @retval    None
 */
void RCM_EnableInterrupt(uint32_t interrupt)
{
    uint32_t temp;

    temp = interrupt << 8;

    RCM->INT |= temp;
}

/*!
 * @brief     Disable RCM interrupts
 *
 * @param     interrupt : Disable the specified RCM interrupt sources.
 *              This parameter can be any combination of the following values:
 *              @arg RCM_INT_LSIRDY : LSI ready interrupt
 *              @arg RCM_INT_LSERDY : LSE ready interrupt
 *              @arg RCM_INT_HSIRDY : HSI ready interrupt
 *              @arg RCM_INT_HSERDY : HSE ready interrupt
 *              @arg RCM_INT_PLLRDY : PLL ready interrupt
 *
 * @retval    None
 */
void RCM_DisableInterrupt(uint32_t interrupt)
{
    uint32_t temp;

    temp = interrupt << 8;

    RCM->INT &= (uint32_t)~temp;
}

/*!
 * @brief     Read the specified RCM flag status
 *
 * @param     flag : Return the specified flag status.
 *              This parameter can be one of the following values:
 *              @arg RCM_FLAG_HSIRDY  : HSI ready flag
 *              @arg RCM_FLAG_HSERDY  : HSE ready flag
 *              @arg RCM_FLAG_PLLRDY  : PLL ready flag
 *              @arg RCM_FLAG_LSERDY  : LSE ready flag
 *              @arg RCM_FLAG_LSIRDY  : LSI ready flag
 *              @arg RCM_FLAG_PINRST  : NRST PIN Reset Occur Flag
 *              @arg RCM_FLAG_PORRST  : POR/PDR Reset Occur Flag
 *              @arg RCM_FLAG_SWRST   : Software Reset Occur Flag
 *              @arg RCM_FLAG_IWDTRST : Independent Watchdog Reset Occur Flag
 *              @arg RCM_FLAG_WWDTRST : Window Watchdog Reset Occur Flag
 *              @arg RCM_FLAG_LPRRST  : Low Power Reset Occur Flag
 *
 * @retval    The new state of flag (SET or RESET)
 */
uint8_t RCM_ReadStatusFlag(RCM_FLAG_T flag)
{
    uint32_t reg, bit;

    bit = (uint32_t)(1 << (flag & 0xff));

    reg = (flag >> 8) & 0xff;

    switch (reg)
    {
        case 0:
            reg = RCM->CTRL;
            break;

        case 1:
            reg = RCM->BDCTRL;
            break;

