RT-Thread/rt-thread/bsp/apm32/libraries/APM32S10x_Library/APM32S10x_StdPeriphDriver/src/apm32s10x_rcm.c
        case 2:
            reg = RCM->CSTS;
            break;

        default:
            break;
    }

    if (reg & bit)
    {
        return SET;
    }

    return RESET;
}

/*!
 * @brief     Clear all the RCM reset flags
 *
 * @param     None
 *
 * @retval    None
 *
 * @note      The reset flags are:
 *            RCM_FLAG_PINRST,  RCM_FLAG_PWRST,   RCM_FLAG_SWRST,
 *            RCM_FLAG_IWDTRST, RCM_FLAG_WWDTRST, RCM_FLAG_LPRRST
 */
void RCM_ClearStatusFlag(void)
{
    RCM->CSTS_B.RSTFLGCLR = BIT_SET;
}

/*!
 * @brief     Read the specified RCM interrupt Flag
 *
 * @param     flag : Read the specified RCM interrupt flag.
 *              This parameter can be one of the following values:
 *              @arg RCM_INT_LSIRDY : LSI ready interrupt flag
 *              @arg RCM_INT_LSERDY : LSE ready interrupt flag
 *              @arg RCM_INT_HSIRDY : HSI ready interrupt flag
 *              @arg RCM_INT_HSERDY : HSE ready interrupt flag
 *              @arg RCM_INT_PLLRDY : PLL ready interrupt flag
 *              @arg RCM_INT_CSS    : Clock Security System interrupt flag
 *
 * @retval    The new state of intFlag (SET or RESET)
 */
uint8_t RCM_ReadIntFlag(RCM_INT_T flag)
{
    return (RCM->INT& flag) ? SET : RESET;
}

/*!
 * @brief     Clear the interrupt flag
 *
 * @param     flag : Clear the specified interrupt flag.
 *              @arg RCM_INT_LSIRDY : Clear LSI ready interrupt flag
 *              @arg RCM_INT_LSERDY : Clear LSE ready interrupt flag
 *              @arg RCM_INT_HSIRDY : Clear HSI ready interrupt flag
 *              @arg RCM_INT_HSERDY : Clear HSE ready interrupt flag
 *              @arg RCM_INT_PLLRDY : Clear PLL ready interrupt flag
 *              @arg RCM_INT_CSS    : Clear Clock Security System interrupt flag
 *
 * @retval    None
 */
void RCM_ClearIntFlag(uint32_t flag)
{
    uint32_t temp;

    temp = flag << 16;
    RCM->INT |= temp;
}

/**@} end of group RCM_Functions */
/**@} end of group RCM_Driver */
/**@} end of group APM32S10x_StdPeriphDriver */
